<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6df2a7db8580dde3ebffad25d3dd6208b64a67d6826aabd4407bb7a5ace0581c","plan_job_ref":"Job Terraform Plan #522 at https://github.com/cal-itp/data-infra/actions/runs/17777443037","plan_out_hash":"147e5dee26fef5f3f4d612807d2308b0cf32ccb10fbe955215b8497f90b01ba0","plan_hash":"1ed4b75dc685d43e53bbdc54a0c74ead68e0c698a6967935fea158d6a6a95f81","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 1 to add, 3 to change, 8 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.cal-itp-data-infra-enghouse-raw will be destroyed
  # (because google_storage_bucket.cal-itp-data-infra-enghouse-raw is not in configuration)
-   resource "google_storage_bucket" "cal-itp-data-infra-enghouse-raw" {
-       default_event_based_hold    = false -> null
-       effective_labels            = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       enable_object_retention     = false -> null
-       force_destroy               = true -> null
-       id                          = "cal-itp-data-infra-enghouse-raw" -> null
-       labels                      = {} -> null
-       location                    = "US-WEST2" -> null
-       name                        = "cal-itp-data-infra-enghouse-raw" -> null
-       project                     = "cal-itp-data-infra" -> null
-       project_number              = 1005246706141 -> null
-       public_access_prevention    = "inherited" -> null
-       requester_pays              = false -> null
-       self_link                   = "https://www.googleapis.com/storage/v1/b/cal-itp-data-infra-enghouse-raw" -> null
-       storage_class               = "STANDARD" -> null
-       terraform_labels            = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       time_created                = "2025-08-16T05:25:11.898Z" -> null
-       uniform_bucket_level_access = true -> null
-       updated                     = "2025-08-21T20:52:43.664Z" -> null
-       url                         = "gs://cal-itp-data-infra-enghouse-raw" -> null

-       hierarchical_namespace {
-           enabled = false -> null
        }

-       soft_delete_policy {
-           effective_time             = "2025-08-16T05:25:11.898Z" -> null
-           retention_duration_seconds = 604800 -> null
        }
    }

  # google_storage_bucket.tfer--calitp-ntd-api-products must be replaced
-/+ resource "google_storage_bucket" "tfer--calitp-ntd-api-products" {
!~      effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
-       enable_object_retention     = false -> null
!~      id                          = "***********************" -> (known after apply)
-       labels                      = {} -> null
!~      location                    = "US" -> "US-WEST2" # forces replacement
        name                        = "calitp-ntd-api-products"
!~      project_number              = 1005246706141 -> (known after apply)
!~      rpo                         = "DEFAULT" -> (known after apply)
!~      self_link                   = "https://www.googleapis.com/storage/v1/b/calitp-ntd-api-products" -> (known after apply)
!~      terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
!~      time_created                = "2024-08-19T20:42:26.108Z" -> (known after apply)
!~      updated                     = "2024-08-19T20:42:26.108Z" -> (known after apply)
!~      url                         = "gs://calitp-ntd-api-products" -> (known after apply)
#        (7 unchanged attributes hidden)

-       hierarchical_namespace {
-           enabled = false -> null
        }

!~      soft_delete_policy (known after apply)
-       soft_delete_policy {
-           effective_time             = "2024-08-19T20:42:26.108Z" -> null
-           retention_duration_seconds = 604800 -> null
        }

-       timeouts {}

!~      versioning (known after apply)

!~      website (known after apply)
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # google_storage_bucket.tfer--test-calitp-ntd-api-products will be destroyed
  # (because google_storage_bucket.tfer--test-calitp-ntd-api-products is not in configuration)
-   resource "google_storage_bucket" "tfer--test-calitp-ntd-api-products" {
-       default_event_based_hold    = false -> null
-       effective_labels            = {} -> null
-       enable_object_retention     = false -> null
-       force_destroy               = false -> null
-       id                          = "test-calitp-ntd-api-products" -> null
-       labels                      = {} -> null
-       location                    = "US" -> null
-       name                        = "test-calitp-ntd-api-products" -> null
-       project                     = "cal-itp-data-infra" -> null
-       project_number              = 1005246706141 -> null
-       public_access_prevention    = "enforced" -> null
-       requester_pays              = false -> null
-       rpo                         = "DEFAULT" -> null
-       self_link                   = "https://www.googleapis.com/storage/v1/b/test-calitp-ntd-api-products" -> null
-       storage_class               = "STANDARD" -> null
-       terraform_labels            = {} -> null
-       time_created                = "2024-11-13T21:37:58.448Z" -> null
-       uniform_bucket_level_access = true -> null
-       updated                     = "2025-04-10T21:13:39.939Z" -> null
-       url                         = "gs://test-calitp-ntd-api-products" -> null

-       hierarchical_namespace {
-           enabled = false -> null
        }

-       lifecycle_rule {
-           action {
-               type          = "Delete" -> null
#                (1 unchanged attribute hidden)
            }
-           condition {
-               age                                     = 30 -> null
-               days_since_custom_time                  = 0 -> null
-               days_since_noncurrent_time              = 0 -> null
-               matches_prefix                          = [] -> null
-               matches_storage_class                   = [] -> null
-               matches_suffix                          = [] -> null
-               num_newer_versions                      = 0 -> null
-               send_age_if_zero                        = false -> null
-               send_days_since_custom_time_if_zero     = false -> null
-               send_days_since_noncurrent_time_if_zero = false -> null
-               send_num_newer_versions_if_zero         = false -> null
-               with_state                              = "ANY" -> null
#                (3 unchanged attributes hidden)
            }
        }

-       soft_delete_policy {
-           effective_time             = "2024-11-13T21:37:58.448Z" -> null
-           retention_duration_seconds = 604800 -> null
        }
    }

  # google_storage_bucket_acl.tfer--test-calitp-ntd-api-products will be destroyed
  # (because google_storage_bucket_acl.tfer--test-calitp-ntd-api-products is not in configuration)
-   resource "google_storage_bucket_acl" "tfer--test-calitp-ntd-api-products" {
-       bucket      = "test-calitp-ntd-api-products" -> null
-       id          = "test-calitp-ntd-api-products" -> null
-       role_entity = [] -> null
    }

  # google_storage_bucket_iam_binding.tfer--test-calitp-ntd-api-products will be destroyed
  # (because google_storage_bucket_iam_binding.tfer--test-calitp-ntd-api-products is not in configuration)
-   resource "google_storage_bucket_iam_binding" "tfer--test-calitp-ntd-api-products" {
-       bucket  = "b/test-calitp-ntd-api-products" -> null
-       etag    = "CAI=" -> null
-       id      = "test-calitp-ntd-api-products" -> null
-       members = [
-           "projectEditor:cal-itp-data-infra",
-           "projectOwner:cal-itp-data-infra",
        ] -> null
-       role    = "roles/storage.legacyObjectOwner" -> null
    }

  # google_storage_bucket_iam_member.enghouse-raw-default-service-account will be destroyed
  # (because google_storage_bucket_iam_member.enghouse-raw-default-service-account is not in configuration)
-   resource "google_storage_bucket_iam_member" "enghouse-raw-default-service-account" {
-       bucket = "b/cal-itp-data-infra-enghouse-raw" -> null
-       etag   = "CAk=" -> null
-       id     = "b/cal-itp-data-infra-enghouse-raw/roles/storage.objectAdmin/serviceAccount:1005246706141-compute@developer.gserviceaccount.com" -> null
-       member = "serviceAccount:1005246706141-compute@developer.gserviceaccount.com" -> null
-       role   = "roles/storage.objectAdmin" -> null
    }

  # google_storage_bucket_iam_member.tfer--test-calitp-ntd-api-products will be destroyed
  # (because google_storage_bucket_iam_member.tfer--test-calitp-ntd-api-products is not in configuration)
-   resource "google_storage_bucket_iam_member" "tfer--test-calitp-ntd-api-products" {
-       bucket = "b/test-calitp-ntd-api-products" -> null
-       etag   = "CAI=" -> null
-       id     = "test-calitp-ntd-api-products" -> null
-       member = "projectOwner:cal-itp-data-infra" -> null
-       role   = "roles/storage.legacyObjectOwner" -> null
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-rt-raw-v2 will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-rt-raw-v2" {
        id          = "calitp-gtfs-rt-raw-v2"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyBucketOwner"
                    },
!~                  {
!~                      members = [
                            "projectViewer:cal-itp-data-infra",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                    {
                        members = [
                            "projectEditor:cal-itp-data-infra",
                            "projectOwner:cal-itp-data-infra",
                        ]
                        role    = "roles/storage.legacyObjectOwner"
                    },
#                    (2 unchanged elements hidden)
                    {
                        members = [
                            "serviceAccount:gtfs-rt-archiver-v3@cal-itp-data-infra.iam.gserviceaccount.com",
                        ]
                        role    = "roles/storage.objectCreator"
                    },
!~                  {
!~                      members = [
                            "serviceAccount:gtfs-rt-archiver-v3@cal-itp-data-infra.iam.gserviceaccount.com",
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
#                        (1 unchanged attribute hidden)
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_policy.tfer--calitp-gtfs-schedule-raw-v2 will be updated in-place
!~  resource "google_storage_bucket_iam_policy" "tfer--calitp-gtfs-schedule-raw-v2" {
        id          = "calitp-gtfs-schedule-raw-v2"
!~      policy_data = jsonencode(
!~          {
!~              bindings = [
#                    (4 unchanged elements hidden)
                    {
                        members = [
                            "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
                        role    = "roles/storage.objectAdmin"
                    },
-                   {
-                       members = [
-                           "serviceAccount:project-1005246706141@storage-transfer-service.iam.gserviceaccount.com",
                        ]
-                       role    = "roles/storage.objectViewer"
                    },
                ]
            }
        )
#        (2 unchanged attributes hidden)
    }

  # google_storage_default_object_acl.tfer--test-calitp-ntd-api-products will be destroyed
  # (because google_storage_default_object_acl.tfer--test-calitp-ntd-api-products is not in configuration)
-   resource "google_storage_default_object_acl" "tfer--test-calitp-ntd-api-products" {
-       bucket      = "test-calitp-ntd-api-products" -> null
-       id          = "test-calitp-ntd-api-products" -> null
-       role_entity = [] -> null
    }

Plan: 1 to add, 3 to change, 8 to destroy.

Changes to Outputs:
-   google_storage_bucket_acl_tfer--test-calitp-ntd-api-products_id                                            = "test-calitp-ntd-api-products" -> null
-   google_storage_bucket_cal-itp-data-infra-enghouse-raw_name                                                 = "cal-itp-data-infra-enghouse-raw" -> null
-   google_storage_bucket_iam_binding_tfer--test-calitp-ntd-api-products_id                                    = "test-calitp-ntd-api-products" -> null
-   google_storage_bucket_iam_member_tfer--test-calitp-ntd-api-products_id                                     = "test-calitp-ntd-api-products" -> null
-   google_storage_bucket_iam_policy_tfer--test-calitp-ntd-api-products_id                                     = "test-calitp-ntd-api-products" -> null
!~  google_storage_bucket_tfer--calitp-ntd-api-products_self_link                                              = "https://www.googleapis.com/storage/v1/b/calitp-ntd-api-products" -> (known after apply)
-   google_storage_bucket_tfer--test-calitp-ntd-api-products_name                                              = "test-calitp-ntd-api-products" -> null
-   google_storage_bucket_tfer--test-calitp-ntd-api-products_self_link                                         = "https://www.googleapis.com/storage/v1/b/test-calitp-ntd-api-products" -> null
-   google_storage_default_object_acl_tfer--test-calitp-ntd-api-products_id                                    = "test-calitp-ntd-api-products" -> null
```
</details>

:memo: Plan generated in [Terraform Plan #522](https://github.com/cal-itp/data-infra/actions/runs/17777443037)